import 'package:flutter/foundation.dart';

class Recipe{
  final String categoryName;
  final String image;
  final String recipeName;
  final int cookingTime;
  final String complexityCooking;
  final List<Map<String, double>> ingredientsPrice;
  final List<String> tegs;
  final List<String> ingredients;
  final List<String> cookingSteps;

  Recipe({
    this.categoryName = '',
    this.image = '',
    this.recipeName = '',
    this.cookingTime = 0,
    this.complexityCooking = '',
    this.ingredientsPrice = const [],
    this.tegs = const [],
    this.ingredients = const [],
    this.cookingSteps = const [],
  });
}

class RecipeData{
  final List<Recipe> categoryDataList = [
    Recipe(
      categoryName: 'Перші страви (супи)',
      image: 'assets/Soup.jpg',
    ),
    Recipe(
      categoryName: 'Другі страви (каші, страви з м’яса)',
      image: 'assets/Pilaf.jpg',
    ),
    Recipe(
      categoryName: 'Салати та закуски',
      image: 'assets/Chicken rolls.jpg',
    ),
    Recipe(
      categoryName: 'Десерти',
      image: 'assets/Pancakes.jpg',
    ),
    Recipe(
      categoryName: 'Напої',
      image: 'assets/Сocktail.jpg',
    ),
    Recipe(
      categoryName: 'Випічка',
      image: 'assets/Cheesecake.jpg',
    ),
    Recipe(
      categoryName: 'Улюблені',
      image: 'assets/Pancakes.jpg',
    ),
  ];
  final List<Recipe> soupDataList = [
    Recipe(
        categoryName: 'Перші страви (супи)',
        image: 'assets/Soup.jpg',
        recipeName: 'Овочевий суп з плавленим сиром',
        cookingTime: 80,
        complexityCooking: 'Середня',
        ingredientsPrice: [
          {'Курка – будь-яка частина (400 г)' : 76.5},
          {'Картопля (3 шт.)' : 6},
          {'Цибуля (1 шт.)' : 4.70},
          {'Морква (1 шт.)' : 15},
          {'Броколі (100 г)' : 10.5},
          {'Цвітна капуста (100 г)' : 8.9},
          {'Сирок плавлений (3 шт.)' : 60},
          {'Сметана (5 ст. л.)' : 10},
          {'Сіль' : 1},
          {'Загальна сума' : 192.6},
        ],
        tegs: [
          'Рецепти супів',
          'Овочевий суп',
          'Перші страви',
          'М\'ясні страви'
        ],
        ingredients: [
          'Курка – будь–яка частина (400 г)',
          'Картопля (3 шт)',
          'Картопля (3 шт)',
          'Морква (1 шт)',
          'Броколі (100 г)',
          'Цвітна капуста (100 г)',
          'Сирок плавлений (3 шт)',
          'Сметанна (5 ст. л.)',
          'Сіль (за смаком)',
          'Вода (1 л)'
        ],
        cookingSteps: [
          'М\'ясо промиваємо та ставимо варитись. Як тільки закипить зробити маленький вогонь та залишити кипіти на 40 хв.',
          'Картоплю очищаємо від шкірки, потім нарізаємо невеликими кубиками (2х2), і додаємо  у каструлю з водою та куркою.',
          'Цибулю очистити, подрібнити на маленькі кубики та піджарити на сковорідці до золотистого кольору, до цибулі додати натерту моркву та тушкуємо на маленькому вогні близько 5-7 хвилин. Потім цю суміш додати у каструлю.',
          'Броколі та цвітну капусту промити та порізати на невеличкі кусочки. Нарізати також сирки та перемішати разом із сметаною, все додати в каструлю та додати сіль за смаком.',
          'Суп довести до кипіння, та варити на маленькому вогні до повної готовності близько 30 хвилин.'
        ]
    )
  ];
  final List<Recipe> porridgeDataList = [
    Recipe(
        categoryName: 'Другі страви (каші, страви з м’яса)',
        image: 'assets/Pilaf.jpg',
        recipeName: 'Плов з телячим м’ясом',
        cookingTime: 65,
        complexityCooking: 'Складно',
        ingredientsPrice: [
          {'Телятина (250 г)' : 45.50},
          {'Цибуля ріпчаста (1 шт.)' : 4.70},
          {'Морква (1 шт.)' : 15},
          {'Рис довгозернистий (2 склянки)' : 23},
          {'Часник (3 зубчики)' : 7},
          {'Приправа (за смаком)' : 10},
          {'Кетчуп для шашлику (3 ст. л.)' : 5.70},
          {'Загальна сума' : 110.90},
        ],
        tegs: [
          'Каші з рису',
          'М\'ясні страви',
          'Страви на обід'
        ],
        ingredients: [
          'Телятина (250 г)',
          'Цибуля ріпчаста (1 шт.)',
          'Морква (1 шт.)',
          'Рис довгозернистий (2 склянки)',
          'Часник (3 зубчики)',
          'Приправа (за смаком)',
          'Кетчуп для шашлику (3 ст. л.)',
          'Вода (3 склянки)',
        ],
        cookingSteps: [
          'Нарізаємо м\'ясо на кубики будь якого розміру, але не дрібніше 1 см, так як м\'ясо може ужаритися і втратити смак.',
          'Цибулю ріжемо кубиками, моркву тремо на крупній тертці. Цибулю обсмажуємо в першу чергу на рослинному маслі, щоб передалися аромати.',
          'Смажимо цибулю 2-3 хв. та додаємо моркву. Тримаємо на вогні ще 3 хвилини.',
          'Викладаємо нарізане м\'ясо, обсмажуємо з усіх боків 15 хв., та додаємо приправи та сіль за смаком. Перемішуємо все додаючи кетчуп, залишаємо на маленькому вогні та накриваємо кришкою.',
          'Через 20 хвилин додаємо рис та воду, доводимо до кипіння, та залишаємо на маленькому вогні до повного приготування.'
        ]
    ),
    Recipe(
        categoryName: 'Другі страви (каші, страви з м’яса)',
        image: 'assets/grechaniki.jpg',
        recipeName: 'Гречаники у томатно-сметанному соусі',
        cookingTime: 90,
        complexityCooking: 'Середня',
        ingredientsPrice: [
          {'Гречана крупа - 1 склянка' : 19},
          {'М\'ясний фарш - 500 гр.' : 130},
          {'Цибуля (1 шт.)' : 4.70},
          {'Яйця курячі - 2 шт.' : 4.50},
          {'Цибуля ріпчаста - 1 шт.' : 4.70},
          {'Сіль, перець - за смаком' : 1},
          {'Томатний соус – 100 мл.' : 10.70},
          {'Сметанна – 50 мл.' : 9},
          {'Загальна сума' : 178.9},
        ],
        tegs: [
          'Каші з гречки',
          'М\'ясні страви',
          'Страви на обід',
        ],
        ingredients: [
          'Гречана крупа - 1 склянка',
          'М\'ясний фарш - 500 гр.',
          'Цибуля (1 шт.)',
          'Яйця курячі - 2 шт.',
          'Цибуля ріпчаста - 1 шт.',
          'Сіль, перець - за смаком',
          'Томатний соус – 100 мл.',
          'Сметанна – 50 мл.',
        ],
        cookingSteps: [
          'Гречку відварюємо та охолоджуємо.',
          'Додаємо фарш, натерту цибулю та яйця.',
          'Все перемішуємо та додаємо сіль та перець за смаком.',
          'Формуємо котлетки та обсмажуємо з обох сторін до неповної готовності. Перекладаємо у форму для випічки, заливаємо томатно-сметанним соусом, та запікаємо 30 хв. При температурі 180 ° С.',
        ]
    ),
    Recipe(
        categoryName: 'Другі страви (каші, страви з м’яса)',
        image: 'assets/grechka.jpg',
        recipeName: 'Гречка з м’ясом запечена в духовці',
        cookingTime: 90,
        complexityCooking: 'Середня',
        ingredientsPrice: [
          {'Гречана крупа - 2 склянки' : 38},
          {'Куряче філе - 600 гр.' : 89},
          {'Цибуля ріпчаста - 2 шт.' : 9},
          {'Морква (2 шт.)' : 20},
          {'Сіль, перець - за смаком' : 1},
          {'Сир  - 250 г' : 30},
          {'Рослинна олія— 3 ст. л.' : 2},
          {'Загальна сума' : 189},
        ],
        tegs: [
          'Каші з гречки',
          'М\'ясні страви',
          'Страви на обід',
        ],
        ingredients: [
          'Гречана крупа - 2 склянки',
          'Куряче філе - 600 гр.',
          'Цибуля ріпчаста - 2 шт.',
          'Морква (2 шт.)',
          'Сіль, перець - за смаком',
          'Сир  - 250 г',
          'Рослинна олія— 3 ст. л.',
        ],
        cookingSteps: [
          'М\'ясо нарізаємо невеликими шматочками і обсмажуємо на рослинному маслі до появи скоринки. Додаємо дрібно нарізану цибулю і обсмажуємо з м\'ясом хвилин 5.',
          'Потім додаємо натерту моркву, половину солі, чорний перець, доливаємо приблизно півсклянки води і тушкуємо на середньому вогні, поки вода практично повністю не випарується.',
          'Викладаємо м\'ясо в ємність, в якій можна готувати в духовці. Засипаємо зверху промиту гречану крупу. Розрівнюємо, додаємо сіль і наливаємо 4 склянки води. Зверху посипаємо натертим сиром та ставимо в розігріту до 180 ° С  духовку, приблизно хвилин на 45-50.',
        ]
    )
  ];
  final List<Recipe> saladsAndAppetizerDataList = [
    Recipe(
        categoryName: 'Салати та закуски',
        image: 'assets/Chicken rolls.jpg',
        recipeName: 'Курячі рулети з сиром',
        cookingTime: 130,
        complexityCooking: 'Середня',
        ingredientsPrice: [
          {'Філе куряче 3 шт.' : 123.70},
          {'Сушена паприка 1 ч. л.' : 6},
          {'Майонез 5 ст. л.' : 17},
          {'Гірчиця 5 ст. л.' : 15},
          {'Сіль по смаку' : 1},
          {'Сир 100 гр.' : 12},
          {'Часник  3 зубчика' : 7},
          {'Загальна сума' : 187.7},
        ],
        tegs: [
          'М\'ясні страви',
          'Запіканки',
          'Закуски',
          'Холодні страви'
        ],
        ingredients: [
          'Філе куряче 3 шт.',
          'Сушена паприка 1 ч. л.',
          'Майонез 5 ст. л.',
          'Гірчиця 5 ст. л.',
          'Сіль по смаку',
          'Сир 100 гр.',
          'Часник  3 зубчика',
        ],
        cookingSteps: [
          'Куряче філе розрізаємо по довжині, та відбиваємо з обох сторін через харчову плівку.',
          'Солимо, перчимо, натираємо паприкою та майонезом з гірчицею.',
          'Доки м\'ясо маринується, готуємо начинку. Для цього потрібно натерти сир та 3 зубчика часника.',
          'Далі кожну скибочку філе начиняємо сиром з часником, закручуємо в рулет, викладаємо в посудину для випікання та посипаємо тертим сиром.',
          'Випікати 50-60 хв., при температурі 180 ° С.'
        ]
    ),
    Recipe(
        categoryName: 'Салати та закуски',
        image: 'assets/telyat.jpg',
        recipeName: 'Телятина під гірчично-майонезним соусом',
        cookingTime: 220,
        complexityCooking: 'Середня',
        ingredientsPrice: [
          {'Телятина - 500 г.' : 146},
          {'Майонез – 5 ст. л.' : 17},
          {'Гірчиця – 5 ст. л.' : 15},
          {'Часник – 3 зубчика' : 7},
          {'Сіль, перець – за смаком' : 2},
          {'Загальна сума' : 187},
        ],
        tegs: [
          'М\'ясні страви',
          'Випічка',
          'Закуски',
          'Холодні страви',
        ],
        ingredients: [
          'Телятина - 500 г.',
          'Майонез – 5 ст. л.',
          'Гірчиця – 5 ст. л.',
          'Часник – 3 зубчика',
          'Сіль, перець – за смаком',
        ],
        cookingSteps: [
          'Для початку м\'ясо потрібно підготувати зробивши невеличкі надрізи. Далі солимо та перчимо.',
          'Майонез та гірчицю перемішуємо та додаємо натертий часник.',
          'М\'ясо маринуємо готовою сумішшю та залишаємо маринуватись на 2 години.',
          'Після цього м\'ясо викладаємо в рукав для випічки, та запікаємо 80-100 хв. При температурі 200 ° С, за 15 хвилин до готовності рукав розрізати, щоб з\'явилася скориночка.',
        ]
    ),
    Recipe(
        categoryName: 'Салати та закуски',
        image: 'assets/potato purozhki.jpg',
        recipeName: 'Картопляні пиріжки з м’ясом',
        cookingTime: 70,
        complexityCooking: 'Середня',
        ingredientsPrice: [
          {'Ріпчаста цибуля – 2 шт.' : 10},
          {'Картопля – 1 кг.' : 13},
          {'М’ясо – 500 г.' : 90},
          {'Яйця – 3 шт.' : 14.50},
          {'Борошно – 200 г.' : 16},
          {'Спеції – 1 ст. л.' : 2},
          {'Дріжджі – 10 г.' : 11},
          {'Цукор – 2 ст. л.' : 3},
          {'Загальна сума' : 159.5},
        ],
        tegs: [
          'М\'ясні страви',
          'Закуски',
          'Холодні страви',
        ],
        ingredients: [
          'Ріпчаста цибуля – 2 шт.',
          'Картопля – 1 кг.',
          'М’ясо – 500 г.',
          'Яйця – 3 шт.',
          'Борошно – 200 г.',
          'Спеції – 1 ст. л.',
          'Дріжджі – 10 г.',
          'Цукор – 2 ст. л.',
        ],
        cookingSteps: [
          'Для початку дріжджі засипати цукром та залишити на декілька хвилин.',
          'Картоплю відварити, перекрутити на м’ясорубці та додати сіль, перець.',
          'Охолодивши картоплю додаємо яйця, вливаємо дріжджі та перемішуємо до однорідної маси. Далі додаємо борошно замішуючи тісто.',
          'Для начинки необхідно м’ясо та цибулю прокрутити на м’ясорубці. Додати сіль та перець за смаком.',
          'Для формуванням самих пиріжків відриваємо невеликий шматочок від картопляного тіста, злегка розкачуємо, щоб вийшов не надто тонкий коржик.',
          'Далі, беремо ложку начинки, викладаємо її на корж з тіста і з’єднуємо, роблячи повноцінний пиріжок. Таким чином, такі дії виконуємо з кожним пиріжком. Кожний пиріжок обсмажуємо на рослинному маслі х двох сторін до коричневої скоринки.'
        ]
    )
  ];
  final List<Recipe> dessertsDataList = [
    Recipe(
        categoryName: 'Десерти',
        image: 'assets/Pancakes.jpg',
        recipeName: 'Солодкі млинці з сирною начинкою та шоколадним соусом',
        cookingTime: 50,
        complexityCooking: 'Легко',
        ingredientsPrice: [
          {'Молоко — 500 мл.' : 10},
          {'Яйця — 2 шт.' : 9},
          {'Цукор — 1 ст. л.' : 0.5},
          {'Сіль — 1/2 ч. л.' : 0.2},
          {'Какао — 2 — ст. л.' : 2},
          {'Борошно — 150 грамів' : 16},
          {'Рослинна олія — 2 ст. л.' : 1},
          {'Сир — 250 г.' : 33.7},
          {'Сметана — 4 ст. л.' : 5},
          {'Цукор — 100 гр.' : 12},
          {'Сметанна— 2 ст. л.' : 2},
          {'Цукор — 2 ст. л.' : 1},
          {'Какао-порошок — 1 ч. л.' : 1},
          {'Загальна сума' : 93.4},
        ],
        tegs: [
          'Десерти',
          'Солодка випічка',
          'Десерти з сиром',
        ],
        ingredients: [
          'Молоко — 500 мл.',
          'Яйця — 2 шт.',
          'Цукор — 1 ст. л.',
          'Сіль — 1/2 ч. л.',
          'Какао — 2 — ст. л.',
          'Борошно — 150 грамів',
          'Рослинна олія — 2 ст. л.',
          'Сир — 250 г.',
          'Сметана — 4 ст. л.',
          'Цукор — 100 гр.',
          'Сметанна— 2 ст. л.',
          'Цукор — 2 ст. л.',
          'Какао-порошок — 1 ч. л.',
        ],
        cookingSteps: [
          'Збити вінчиком яйця з цукром і сіллю.',
          'Влити тепле молоко, збити все разом.',
          'Просіяти борошно, додати какао, перемішати.',
          'Залишити на 10 хвилин.',
          'Додати рослинну олію перемішати.',
          'Замісити млинцеве тісто.',
          'Смажити млинці до рум\'яного кольору.',
          'Змішати сир, цукор, сметану. Начинка не повинна бути рідкою.',
          'З\'єднати в сотейнику какао, цукор і сметану для соусу.',
          'Варити соус на повільному вогні 1 хвилину. Не допускати закипання.',
          'Млинець змастити сирною начинкою, згорнути в рулетик.',
          'Полити готові млинці шоколадним соусом.',
        ]
    ),
  ];
  final List<Recipe> drinksDataList = [
    Recipe(
        categoryName: 'Напої',
        image: 'assets/Сocktail.jpg',
        recipeName: 'Коктейль "Молочно-банановий"',
        cookingTime: 10,
        complexityCooking: 'Легко',
        ingredientsPrice: [
          {'Банан – 1шт.' : 7},
          {'Морозиво - 100 мл.' : 12},
          {'Какао – 2 ч. л' : 2},
          {'Ванільний цукор – 0,5 ч. л.' : 2},
          {'Молоко  2,5 % - 300 мл' : 8},
          {'Загальна сума' : 31},
        ],
        tegs: [
          'Солодкі напої',
          'Молочні коктейлі',
          'Сніданок',
        ],
        ingredients: [
          'Банан – 1шт.',
          'Морозиво - 100 мл.',
          'Какао – 2 ч. л',
          'Ванільний цукор – 0,5 ч. л.',
          'Молоко  2,5 % - 300 мл',
        ],
        cookingSteps: [
          'Порізати банан кружечками.',
          'Всі інгредієнти покласти до блендера або ж збити за допомогою міксера.',
          'Розлити в стакани.',
        ]
    ),
  ];
  final List<Recipe> bakingDataList = [
    Recipe(
        categoryName: 'Випічка',
        image: 'assets/Cheesecake.jpg',
        recipeName: 'Королівська ватрушка з сиром',
        cookingTime: 60,
        complexityCooking: 'Середня',
        ingredientsPrice: [
          {'Борошно - 360 г' : 25},
          {'Розпушувач - 10 г' : 4},
          {'Цукор 242 г' : 35},
          {'Вершкове масло 150 г' : 70},
          {'Сир – 700 г' : 87},
          {'Ванілін - 1ст. л.' : 2},
          {'Ізюм – 200 г' : 21},
          {'Загальна ціна' : 244},
        ],
        tegs: [
          'Солодощі',
          'Солодка випічка',
          'Запіканка з сиром',
        ],
        ingredients: [
          'Борошно - 360 г',
          'Розпушувач - 10 г',
          'Цукор 242 г',
          'Вершкове масло 150 г',
          'Сир – 700 г',
          'Ванілін - 1ст. л.',
          'Ізюм – 200 г',
        ],
        cookingSteps: [
          'Для початку готуємо начинку, для цього до сиру додаємо цукор, ванілін, яйця та збиваємо блендером до однорідної маси. Після цього промиваємо ізюм та додаємо до сирної маси, все перемішуємо.',
          'Далі готуємо саме тісто. Борошно та розпушувач просіяти через сито та додати цукор. Все перемішати. Охолоджене в морозильній камері масло натерти на крупній терці та додати до тіста. Розтираємо руками в крихту.',
          'Форму для випікання змащуємо маслом і викладаємо 2/3 тіста формуючи дно та боки. Всередину виливаємо сирно-яєчну суміш і знову викладаємо тісто.',
          'Духовку розігріваємо до 180 ° С і випікаємо ватрушку 30-40 хвилин.'
        ]
    ),
    Recipe(
        categoryName: 'Випічка',
        image: 'assets/apple pie.jpg',
        recipeName: 'Яблучний пиріг "Шарлотка"',
        cookingTime: 70,
        complexityCooking: 'Середня',
        ingredientsPrice: [
          {'Яблука – 4 шт.' : 8.70},
          {'Борошно – 270' : 20},
          {'Яйця - 6 шт.' : 24},
          {'Ванілін – 1 ст. л.' : 2},
          {'Цукор – 270 г' : 31},
          {'Вершкове масло – 150 г' : 70},
          {'Розпушувач – 15 г' : 5},
          {'Загальна ціна' : 160.7},
        ],
        tegs: [
          'Солодощі',
          'Солодка випічка',
          'Пиріг з яблуками',
        ],
        ingredients: [
          'Яблука – 4 шт.',
          'Борошно – 270',
          'Яйця - 6 шт.',
          'Ванілін – 1 ст. л.',
          'Цукор – 270 г',
          'Вершкове масло – 150 г',
          'Розпушувач – 15 г',
        ],
        cookingSteps: [
         'Найперше підготуємо яблука. Для цього потрібно очистити яблука від шкірки та подрібнити на маленькі квадратики, і ще половинку порізати невеличкими скибочками.',
         'Далі готуємо тісто. Для цього потрібно яйця збити міксером з цукром та ваніліном. Далі додаємо розтоплене та охолоджене масло, все перемішуємо до однорідної маси.',
         'Борошно просіюємо разом з розпушувачем через сито та додаємо в тісто, ще раз збиваємо все міксером.',
         'Коли тісто готове додаємо до маси порізані яблука та перемішуємо.',
         'Форму для випікання змащуємо маслом та посипаємо борошном.',
         'Виливаємо у форму наше тісто, та викладаємо поверх яблука нарізані скибочками у формі розочки.',
         'Випікати 40 хв., при температурі 190 ° С.',
        ]
    ),
  ];
  final List<String> tagsDataLists = [
    'Рецепти супів',
    'Овочевий суп',
    'Перші страви',
    'М\'ясні страви',
    'Каші з рису',
    'Страви на обід',
    'Каші з гречки',
    'Запіканки',
    'Закуски',
    'Холодні страви',
    'Випічка',
    'Десерти',
    'Солодка випічка',
    'Десерти з сиром',
    'Солодкі напої',
    'Молочні коктейлі',
    'Сніданок',
    'Солодощі',
    'Запіканка з сиром',
    'Пиріг з яблуками',
  ];

  final List<Recipe> allRecipesDataList = [
    Recipe(
        categoryName: 'Перші страви (супи)',
        image: 'assets/Soup.jpg',
        recipeName: 'Овочевий суп з плавленим сиром',
        cookingTime: 80,
        complexityCooking: 'Середня',
        ingredientsPrice: [
          {'Курка – будь-яка частина (400 г)' : 76.5},
          {'Картопля (3 шт.)' : 6},
          {'Цибуля (1 шт.)' : 4.70},
          {'Морква (1 шт.)' : 15},
          {'Броколі (100 г)' : 10.5},
          {'Цвітна капуста (100 г)' : 8.9},
          {'Сирок плавлений (3 шт.)' : 60},
          {'Сметана (5 ст. л.)' : 10},
          {'Сіль' : 1},
          {'Загальна сума' : 192.6},
        ],
        tegs: [
          'Рецепти супів',
          'Овочевий суп',
          'Перші страви',
          'М’ясні страви'
        ],
        ingredients: [
          'Курка – будь–яка частина (400 г)',
          'Картопля (3 шт)',
          'Картопля (3 шт)',
          'Морква (1 шт)',
          'Броколі (100 г)',
          'Цвітна капуста (100 г)',
          'Сирок плавлений (3 шт)',
          'Сметанна (5 ст. л.)',
          'Сіль (за смаком)',
          'Вода (1 л)'
        ],
        cookingSteps: [
          'М\'ясо промиваємо та ставимо варитись. Як тільки закипить зробити маленький вогонь та залишити кипіти на 40 хв.',
          'Картоплю очищаємо від шкірки, потім нарізаємо невеликими кубиками (2х2), і додаємо  у каструлю з водою та куркою.',
          'Цибулю очистити, подрібнити на маленькі кубики та піджарити на сковорідці до золотистого кольору, до цибулі додати натерту моркву та тушкуємо на маленькому вогні близько 5-7 хвилин. Потім цю суміш додати у каструлю.',
          'Броколі та цвітну капусту промити та порізати на невеличкі кусочки. Нарізати також сирки та перемішати разом із сметаною, все додати в каструлю та додати сіль за смаком.',
          'Суп довести до кипіння, та варити на маленькому вогні до повної готовності близько 30 хвилин.'
        ]
    ),
    Recipe(
        categoryName: 'Другі страви (каші, страви з м’яса)',
        image: 'assets/Pilaf.jpg',
        recipeName: 'Плов з телячим м’ясом',
        cookingTime: 65,
        complexityCooking: 'Складно',
        ingredientsPrice: [
          {'Телятина (250 г)' : 45.50},
          {'Цибуля ріпчаста (1 шт.)' : 4.70},
          {'Морква (1 шт.)' : 15},
          {'Рис довгозернистий (2 склянки)' : 23},
          {'Часник (3 зубчики)' : 7},
          {'Приправа (за смаком)' : 10},
          {'Кетчуп для шашлику (3 ст. л.)' : 5.70},
          {'Загальна сума' : 110.90},
        ],
        tegs: [
          'Каші з рису',
          'М\'ясні страви',
          'Страви на обід'
        ],
        ingredients: [
          'Телятина (250 г)',
          'Цибуля ріпчаста (1 шт.)',
          'Морква (1 шт.)',
          'Рис довгозернистий (2 склянки)',
          'Часник (3 зубчики)',
          'Приправа (за смаком)',
          'Кетчуп для шашлику (3 ст. л.)',
          'Вода (3 склянки)',
        ],
        cookingSteps: [
          'Нарізаємо м\'ясо на кубики будь якого розміру, але не дрібніше 1 см, так як м\'ясо може ужаритися і втратити смак.',
          'Цибулю ріжемо кубиками, моркву тремо на крупній тертці. Цибулю обсмажуємо в першу чергу на рослинному маслі, щоб передалися аромати.',
          'Смажимо цибулю 2-3 хв. та додаємо моркву. Тримаємо на вогні ще 3 хвилини.',
          'Викладаємо нарізане м\'ясо, обсмажуємо з усіх боків 15 хв., та додаємо приправи та сіль за смаком. Перемішуємо все додаючи кетчуп, залишаємо на маленькому вогні та накриваємо кришкою.',
          'Через 20 хвилин додаємо рис та воду, доводимо до кипіння, та залишаємо на маленькому вогні до повного приготування.'
        ]
    ),
    Recipe(
        categoryName: 'Другі страви (каші, страви з м’яса)',
        image: 'assets/grechaniki.jpg',
        recipeName: 'Гречаники у томатно-сметанному соусі',
        cookingTime: 90,
        complexityCooking: 'Середня',
        ingredientsPrice: [
          {'Гречана крупа - 1 склянка' : 19},
          {'М\'ясний фарш - 500 гр.' : 130},
          {'Цибуля (1 шт.)' : 4.70},
          {'Яйця курячі - 2 шт.' : 4.50},
          {'Цибуля ріпчаста - 1 шт.' : 4.70},
          {'Сіль, перець - за смаком' : 1},
          {'Томатний соус – 100 мл.' : 10.70},
          {'Сметанна – 50 мл.' : 9},
          {'Загальна сума' : 178.9},
        ],
        tegs: [
          'Каші з гречки',
          'М\'ясні страви',
          'Страви на обід',
        ],
        ingredients: [
          'Гречана крупа - 1 склянка',
          'М\'ясний фарш - 500 гр.',
          'Цибуля (1 шт.)',
          'Яйця курячі - 2 шт.',
          'Цибуля ріпчаста - 1 шт.',
          'Сіль, перець - за смаком',
          'Томатний соус – 100 мл.',
          'Сметанна – 50 мл.',
        ],
        cookingSteps: [
          'Гречку відварюємо та охолоджуємо.',
          'Додаємо фарш, натерту цибулю та яйця.',
          'Все перемішуємо та додаємо сіль та перець за смаком.',
          'Формуємо котлетки та обсмажуємо з обох сторін до неповної готовності. Перекладаємо у форму для випічки, заливаємо томатно-сметанним соусом, та запікаємо 30 хв. При температурі 180 ° С.',
        ]
    ),
    Recipe(
        categoryName: 'Другі страви (каші, страви з м’яса)',
        image: 'assets/grechka.jpg',
        recipeName: 'Гречка з м’ясом запечена в духовці',
        cookingTime: 90,
        complexityCooking: 'Середня',
        ingredientsPrice: [
          {'Гречана крупа - 2 склянки' : 38},
          {'Куряче філе - 600 гр.' : 89},
          {'Цибуля ріпчаста - 2 шт.' : 9},
          {'Морква (2 шт.)' : 20},
          {'Сіль, перець - за смаком' : 1},
          {'Сир  - 250 г' : 30},
          {'Рослинна олія— 3 ст. л.' : 2},
          {'Загальна сума' : 189},
        ],
        tegs: [
          'Каші з гречки',
          'М\'ясні страви',
          'Страви на обід',
        ],
        ingredients: [
          'Гречана крупа - 2 склянки',
          'Куряче філе - 600 гр.',
          'Цибуля ріпчаста - 2 шт.',
          'Морква (2 шт.)',
          'Сіль, перець - за смаком',
          'Сир  - 250 г',
          'Рослинна олія— 3 ст. л.',
        ],
        cookingSteps: [
          'М\'ясо нарізаємо невеликими шматочками і обсмажуємо на рослинному маслі до появи скоринки. Додаємо дрібно нарізану цибулю і обсмажуємо з м\'ясом хвилин 5.',
          'Потім додаємо натерту моркву, половину солі, чорний перець, доливаємо приблизно півсклянки води і тушкуємо на середньому вогні, поки вода практично повністю не випарується.',
          'Викладаємо м\'ясо в ємність, в якій можна готувати в духовці. Засипаємо зверху промиту гречану крупу. Розрівнюємо, додаємо сіль і наливаємо 4 склянки води. Зверху посипаємо натертим сиром та ставимо в розігріту до 180 ° С  духовку, приблизно хвилин на 45-50.',
        ]
    ),
    Recipe(
        categoryName: 'Салати та закуски',
        image: 'assets/Chicken rolls.jpg',
        recipeName: 'Курячі рулети з сиром',
        cookingTime: 130,
        complexityCooking: 'Середня',
        ingredientsPrice: [
          {'Філе куряче 3 шт.' : 123.70},
          {'Сушена паприка 1 ч. л.' : 6},
          {'Майонез 5 ст. л.' : 17},
          {'Гірчиця 5 ст. л.' : 15},
          {'Сіль по смаку' : 1},
          {'Сир 100 гр.' : 12},
          {'Часник  3 зубчика' : 7},
          {'Загальна сума' : 187.7},
        ],
        tegs: [
          'М\'ясні страви',
          'Запіканки',
          'Закуски',
          'Холодні страви'
        ],
        ingredients: [
          'Філе куряче 3 шт.',
          'Сушена паприка 1 ч. л.',
          'Майонез 5 ст. л.',
          'Гірчиця 5 ст. л.',
          'Сіль по смаку',
          'Сир 100 гр.',
          'Часник  3 зубчика',
        ],
        cookingSteps: [
          'Куряче філе розрізаємо по довжині, та відбиваємо з обох сторін через харчову плівку.',
          'Солимо, перчимо, натираємо паприкою та майонезом з гірчицею.',
          'Доки м\'ясо маринується, готуємо начинку. Для цього потрібно натерти сир та 3 зубчика часника.',
          'Далі кожну скибочку філе начиняємо сиром з часником, закручуємо в рулет, викладаємо в посудину для випікання та посипаємо тертим сиром.',
          'Випікати 50-60 хв., при температурі 180 ° С.'
        ]
    ),
    Recipe(
        categoryName: 'Салати та закуски',
        image: 'assets/telyat.jpg',
        recipeName: 'Телятина під гірчично-майонезним соусом',
        cookingTime: 220,
        complexityCooking: 'Середня',
        ingredientsPrice: [
          {'Телятина - 500 г.' : 146},
          {'Майонез – 5 ст. л.' : 17},
          {'Гірчиця – 5 ст. л.' : 15},
          {'Часник – 3 зубчика' : 7},
          {'Сіль, перець – за смаком' : 2},
          {'Загальна сума' : 187},
        ],
        tegs: [
          'М\'ясні страви',
          'Випічка',
          'Закуски',
          'Холодні страви',
        ],
        ingredients: [
          'Телятина - 500 г.',
          'Майонез – 5 ст. л.',
          'Гірчиця – 5 ст. л.',
          'Часник – 3 зубчика',
          'Сіль, перець – за смаком',
        ],
        cookingSteps: [
          'Для початку м\'ясо потрібно підготувати зробивши невеличкі надрізи. Далі солимо та перчимо.',
          'Майонез та гірчицю перемішуємо та додаємо натертий часник.',
          'М\'ясо маринуємо готовою сумішшю та залишаємо маринуватись на 2 години.',
          'Після цього м\'ясо викладаємо в рукав для випічки, та запікаємо 80-100 хв. При температурі 200 ° С, за 15 хвилин до готовності рукав розрізати, щоб з\'явилася скориночка.',
        ]
    ),
    Recipe(
        categoryName: 'Салати та закуски',
        image: 'assets/potato purozhki.jpg',
        recipeName: 'Картопляні пиріжки з м’ясом',
        cookingTime: 70,
        complexityCooking: 'Середня',
        ingredientsPrice: [
          {'Ріпчаста цибуля – 2 шт.' : 10},
          {'Картопля – 1 кг.' : 13},
          {'М’ясо – 500 г.' : 90},
          {'Яйця – 3 шт.' : 14.50},
          {'Борошно – 200 г.' : 16},
          {'Спеції – 1 ст. л.' : 2},
          {'Дріжджі – 10 г.' : 11},
          {'Цукор – 2 ст. л.' : 3},
          {'Загальна сума' : 159.5},
        ],
        tegs: [
          'М\'ясні страви',
          'Закуски',
          'Холодні страви',
        ],
        ingredients: [
          'Ріпчаста цибуля – 2 шт.',
          'Картопля – 1 кг.',
          'М’ясо – 500 г.',
          'Яйця – 3 шт.',
          'Борошно – 200 г.',
          'Спеції – 1 ст. л.',
          'Дріжджі – 10 г.',
          'Цукор – 2 ст. л.',
        ],
        cookingSteps: [
          'Для початку дріжджі засипати цукром та залишити на декілька хвилин.',
          'Картоплю відварити, перекрутити на м’ясорубці та додати сіль, перець.',
          'Охолодивши картоплю додаємо яйця, вливаємо дріжджі та перемішуємо до однорідної маси. Далі додаємо борошно замішуючи тісто.',
          'Для начинки необхідно м’ясо та цибулю прокрутити на м’ясорубці. Додати сіль та перець за смаком.',
          'Для формуванням самих пиріжків відриваємо невеликий шматочок від картопляного тіста, злегка розкачуємо, щоб вийшов не надто тонкий коржик.',
          'Далі, беремо ложку начинки, викладаємо її на корж з тіста і з’єднуємо, роблячи повноцінний пиріжок. Таким чином, такі дії виконуємо з кожним пиріжком. Кожний пиріжок обсмажуємо на рослинному маслі х двох сторін до коричневої скоринки.'
        ]
    ),
    Recipe(
        categoryName: 'Десерти',
        image: 'assets/Pancakes.jpg',
        recipeName: 'Солодкі млинці з сирною начинкою та шоколадним соусом',
        cookingTime: 50,
        complexityCooking: 'Легко',
        ingredientsPrice: [
          {'Молоко — 500 мл.' : 10},
          {'Яйця — 2 шт.' : 9},
          {'Цукор — 1 ст. л.' : 0.5},
          {'Сіль — 1/2 ч. л.' : 0.2},
          {'Какао — 2 — ст. л.' : 2},
          {'Борошно — 150 грамів' : 16},
          {'Рослинна олія — 2 ст. л.' : 1},
          {'Сир — 250 г.' : 33.7},
          {'Сметана — 4 ст. л.' : 5},
          {'Цукор — 100 гр.' : 12},
          {'Сметанна— 2 ст. л.' : 2},
          {'Цукор — 2 ст. л.' : 1},
          {'Какао-порошок — 1 ч. л.' : 1},
          {'Загальна сума' : 93.4},
        ],
        tegs: [
          'Десерти',
          'Солодка випічка',
          'Десерти з сиром',
        ],
        ingredients: [
          'Молоко — 500 мл.',
          'Яйця — 2 шт.',
          'Цукор — 1 ст. л.',
          'Сіль — 1/2 ч. л.',
          'Какао — 2 — ст. л.',
          'Борошно — 150 грамів',
          'Рослинна олія — 2 ст. л.',
          'Сир — 250 г.',
          'Сметана — 4 ст. л.',
          'Цукор — 100 гр.',
          'Сметанна— 2 ст. л.',
          'Цукор — 2 ст. л.',
          'Какао-порошок — 1 ч. л.',
        ],
        cookingSteps: [
          'Збити вінчиком яйця з цукром і сіллю.',
          'Влити тепле молоко, збити все разом.',
          'Просіяти борошно, додати какао, перемішати.',
          'Залишити на 10 хвилин.',
          'Додати рослинну олію перемішати.',
          'Замісити млинцеве тісто.',
          'Смажити млинці до рум\'яного кольору.',
          'Змішати сир, цукор, сметану. Начинка не повинна бути рідкою.',
          'З\'єднати в сотейнику какао, цукор і сметану для соусу.',
          'Варити соус на повільному вогні 1 хвилину. Не допускати закипання.',
          'Млинець змастити сирною начинкою, згорнути в рулетик.',
          'Полити готові млинці шоколадним соусом.',
        ]
    ),
    Recipe(
        categoryName: 'Напої',
        image: 'assets/Сocktail.jpg',
        recipeName: 'Коктейль "Молочно-банановий"',
        cookingTime: 10,
        complexityCooking: 'Легко',
        ingredientsPrice: [
          {'Банан – 1шт.' : 7},
          {'Морозиво - 100 мл.' : 12},
          {'Какао – 2 ч. л' : 2},
          {'Ванільний цукор – 0,5 ч. л.' : 2},
          {'Молоко  2,5 % - 300 мл' : 8},
          {'Загальна сума' : 31},
        ],
        tegs: [
          'Солодкі напої',
          'Молочні коктейлі',
          'Сніданок',
        ],
        ingredients: [
          'Банан – 1шт.',
          'Морозиво - 100 мл.',
          'Какао – 2 ч. л',
          'Ванільний цукор – 0,5 ч. л.',
          'Молоко  2,5 % - 300 мл',
        ],
        cookingSteps: [
          'Порізати банан кружечками.',
          'Всі інгредієнти покласти до блендера або ж збити за допомогою міксера.',
          'Розлити в стакани.',
        ]
    ),
    Recipe(
        categoryName: 'Випічка',
        image: 'assets/Cheesecake.jpg',
        recipeName: 'Королівська ватрушка з сиром',
        cookingTime: 60,
        complexityCooking: 'Середня',
        ingredientsPrice: [
          {'Борошно - 360 г' : 25},
          {'Розпушувач - 10 г' : 4},
          {'Цукор 242 г' : 35},
          {'Вершкове масло 150 г' : 70},
          {'Сир – 700 г' : 87},
          {'Ванілін - 1ст. л.' : 2},
          {'Ізюм – 200 г' : 21},
          {'Загальна ціна' : 244},
        ],
        tegs: [
          'Солодощі',
          'Солодка випічка',
          'Запіканка з сиром',
        ],
        ingredients: [
          'Борошно - 360 г',
          'Розпушувач - 10 г',
          'Цукор 242 г',
          'Вершкове масло 150 г',
          'Сир – 700 г',
          'Ванілін - 1ст. л.',
          'Ізюм – 200 г',
        ],
        cookingSteps: [
          'Для початку готуємо начинку, для цього до сиру додаємо цукор, ванілін, яйця та збиваємо блендером до однорідної маси. Після цього промиваємо ізюм та додаємо до сирної маси, все перемішуємо.',
          'Далі готуємо саме тісто. Борошно та розпушувач просіяти через сито та додати цукор. Все перемішати. Охолоджене в морозильній камері масло натерти на крупній терці та додати до тіста. Розтираємо руками в крихту.',
          'Форму для випікання змащуємо маслом і викладаємо 2/3 тіста формуючи дно та боки. Всередину виливаємо сирно-яєчну суміш і знову викладаємо тісто.',
          'Духовку розігріваємо до 180 ° С і випікаємо ватрушку 30-40 хвилин.'
        ]
    ),
    Recipe(
        categoryName: 'Випічка',
        image: 'assets/apple pie.jpg',
        recipeName: 'Яблучний пиріг "Шарлотка"',
        cookingTime: 70,
        complexityCooking: 'Середня',
        ingredientsPrice: [
          {'Яблука – 4 шт.' : 8.70},
          {'Борошно – 270' : 20},
          {'Яйця - 6 шт.' : 24},
          {'Ванілін – 1 ст. л.' : 2},
          {'Цукор – 270 г' : 31},
          {'Вершкове масло – 150 г' : 70},
          {'Розпушувач – 15 г' : 5},
          {'Загальна ціна' : 160.7},
        ],
        tegs: [
          'Солодощі',
          'Солодка випічка',
          'Пиріг з яблуками',
        ],
        ingredients: [
          'Яблука – 4 шт.',
          'Борошно – 270',
          'Яйця - 6 шт.',
          'Ванілін – 1 ст. л.',
          'Цукор – 270 г',
          'Вершкове масло – 150 г',
          'Розпушувач – 15 г',
        ],
        cookingSteps: [
          'Найперше підготуємо яблука. Для цього потрібно очистити яблука від шкірки та подрібнити на маленькі квадратики, і ще половинку порізати невеличкими скибочками.',
          'Далі готуємо тісто. Для цього потрібно яйця збити міксером з цукром та ваніліном. Далі додаємо розтоплене та охолоджене масло, все перемішуємо до однорідної маси.',
          'Борошно просіюємо разом з розпушувачем через сито та додаємо в тісто, ще раз збиваємо все міксером.',
          'Коли тісто готове додаємо до маси порізані яблука та перемішуємо.',
          'Форму для випікання змащуємо маслом та посипаємо борошном.',
          'Виливаємо у форму наше тісто, та викладаємо поверх яблука нарізані скибочками у формі розочки.',
          'Випікати 40 хв., при температурі 190 ° С.',
        ]
    ),
  ];
}